In [7]:
import pandas as pd
df=pd.read_csv("C:\\Users\\29265\\Downloads\\train.csv")

C:\Users\29265\AppData\Local\Continuum\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [12]:
df=df[df.describe().columns]
df=df.head(5)

In [13]:
df

   Store  DayOfWeek  Sales  Customers  Open  Promo  SchoolHoliday
0      1          5   5263        555     1      1              1
1      2          5   6064        625     1      1              1
2      3          5   8314        821     1      1              1
3      4          5  13995       1498     1      1              1
4      5          5   4822        559     1      1              1

In [98]:
#df.isnull().sum()
#df.to_excel('Valnull.xlsx')
#dfnull=pd.read_excel(io.StringIO("C:\\Users\\29265\\Valnull.xlsx"), converters={'strings' : str})
dfnull=pd.read_excel("C:\\Users\\29265\\Valnull.xlsx")
dfnull

   Store  DayOfWeek  Sales  Customers  Open  Promo  SchoolHoliday Name
0      1        5.0   5263      555.0   1.0      1              1   aa
1      2        5.0   6064        NaN   1.0      1              1   bb
2      3        5.0   8314      821.0   1.0      1              1   cc
3      4        NaN  13995     1498.0   NaN      1              1   ZZ
4      5        5.0   4822      559.0   1.0      1              1  NaN

In [99]:
b=dfnull['DayOfWeek'].mode()
b[0]

5.0

In [100]:
 dfnull['Store'].dtypes

dtype('int64')

In [101]:
def filterVariables(df):
    data = []
    for col in df.columns:
        if df[col].nunique()>3: #dtype == 'float64':
            level = 'continuous'
        elif df[col].nunique()<3: #dtype == 'int64':
            level = 'class'
       

        col_dict = {
            'varname': col,
            'datatype': df[col].dtype,
            'continuous_class': level
           
        }
        data.append(col_dict)
        

    meta = pd.DataFrame(data, columns=['varname', 'datatype','continuous_class'])
    meta.set_index('varname', inplace=True)
    return meta

In [102]:
df_new=filterVariables(dfnull)

In [104]:
df_new=df_new.T
df_new

varname,Store,DayOfWeek,Sales,Customers,Open,Promo,SchoolHoliday,Name
datatype,int64,float64,int64,float64,float64,int64,int64,object
continuous_class,continuous,class,continuous,continuous,class,class,class,continuous

In [121]:
def FillNullValue(dfnull):
    df_new=filterVariables(dfnull)
    df_new=df_new.T
    df_new
    for i in df_new.columns:
        for j in dfnull.columns:
            if i==j:
                if list(df_new[i])[1]=='continuous':
                    if dfnull[i].dtypes=='int64':

                        a=dfnull[i].median()
                        dfnull[i].fillna(a,inplace=True)
                    if dfnull[i].dtypes=='float64':
                        a=dfnull[i].mode()
                        dfnull[i].fillna(a[0],inplace=True)
                else:
                    a=dfnull[i].mode()
                    dfnull[i].fillna(a[0],inplace=True)
    return dfnull

In [117]:
dfnull

   Store  DayOfWeek  Sales  Customers  Open  Promo  SchoolHoliday Name
0      1        5.0   5263      555.0   1.0      1              1   aa
1      2        5.0   6064      555.0   1.0      1              1   bb
2      3        5.0   8314      821.0   1.0      1              1   cc
3      4        5.0  13995     1498.0   1.0      1              1   ZZ
4      5        5.0   4822      559.0   1.0      1              1   ZZ

In [112]:
if dfnull['Store'].dtypes=='int64':
    print('sss')

sss

In [38]:
dfnull

   Store  DayOfWeek  Sales  Customers  Open  Promo  SchoolHoliday
0      1        5.0   5263      555.0   1.0      1              1
1      2        5.0   6064      625.0   1.0      1              1
2      3        5.0   8314      821.0   1.0      1              1
3      4        5.0  13995     1498.0   1.0      1              1
4      5        5.0   4822      559.0   1.0      1              1

In [35]:
a=df['DayOfWeek'].mode()
dfnull['DayOfWeek'].fillna(a[0],inplace=True)

In [36]:
dfnull

   Store  DayOfWeek  Sales  Customers  Open  Promo  SchoolHoliday
0      1        5.0   5263      555.0   1.0      1              1
1      2        5.0   6064      625.0   1.0      1              1
2      3        5.0   8314      821.0   1.0      1              1
3      4        5.0  13995     1498.0   NaN      1              1
4      5        5.0   4822      559.0   1.0      1              1

In [34]:
a[0]

5

In [31]:
a

0    5
dtype: int64

In [24]:
dfnull

   Store  DayOfWeek  Sales  Customers  Open  Promo  SchoolHoliday
0      1        5.0   5263      555.0   1.0      1              1
1      2        5.0   6064      625.0   1.0      1              1
2      3        5.0   8314      821.0   1.0      1              1
3      4        NaN  13995     1498.0   NaN      1              1
4      5        5.0   4822      559.0   1.0      1              1